<?php
$ceu = array(
    "Италия" => "Рим",
    "Люксембург" => "Люксембург",
    "Бельгия" => "Брюссель",
    "Дания" => "Копенгаген",
    "Финляндия" => "Хельсинки",
    "Франция "=>"Париж",
    "Словакия"=>"Братислава",
    "Словения"=>"Любляна",
    "Германия"=>"Берлин",
    "Греция"=>"Афины",
    "Ирландия" => "Дублин",
    "Нидерланды" => "Амстердам",
    "Португалия" => "Лиссабон",
    "Испания" => "Мадрид",
    "Швеция" => "Стокгольм",
    "Великобритания" => "Лондон",
    "Кипр"=>"Никосия",
    "Литва"=>"Вильнюс",
    "Чехия"=>"Прага",
    "Эстония"=>"Таллин",
    "Польша "=>"Варшава"
);

// Отсортировать массив по столицам
asort($ceu);

// Вывести список стран и их столиц
foreach ($ceu as $country => $capital) {
    echo "Страна {$country} - столица {$capital}<br>";
}
?>
